import React from "react";
import MainBanner from "../components/mainBanner/MainBanner";
import Entrepreneur from "../components/entrepreneur/Entrepreneur";

const DUMMY_DATA = [
  {
    id:'ent1',
    title: "მეწარმე 1",
    description:
      "კეთილი იყოს თქვენი მობრძანება ჩვენს HTML და CSS კურსში! ამ ყოვლის მომცველ პროგრამაში ჩვენ ჩავუღრმავდებით ვებ დეველოპმენტის სამყაროს და მოგიმზადებთ უნარებითა და ცოდნით განსაცვიფრებელი და საპასუხო ვებსაიტების შესაქმნელად. ჩვენ ჩავუღრმავდებით ვებ დეველოპმენტის სამყაროს და მოგიმზადებთ უნარებითა. კეთილი იყოს თქვენი მობრძანება ჩვენს HTML და CSS კურსში! ამ ყოვლის მომცველ პროგრამაში ჩვენ ჩავუღრმავდებით ვებ დეველოპმენტის სამყაროს და მოგიმზადებთ უნარებითა და ცოდნით განსაცვიფრებელი და საპასუხო ვებსაიტების შესაქმნელად კეთილი იყოს თქვენი მობრძანება ჩვენს HTML და CSS კურსში! ამ ყოვლის მომცველ პროგრამაში ჩვენ ჩავუღრმავდებით ვებ დეველოპმენტის სამყაროს და მოგიმზადებთ უნარებითა და ცოდნით განსაცვიფრებელი და საპასუხო ვებსაიტების შესაქმნელად. ჩვენ ჩავუღრმავდებით ვებ დეველოპმენტის სამყაროს და მოგიმზადებთ უნარებითა. კეთილი იყოს თქვენი მობრძანება ჩვენს HTML და CSS კურსში! ამ ყოვლის მომცველ პროგრამაში ჩვენ ჩავუღრმავდებით ვებ დეველოპმენტის სამყაროს და მოგიმზადებთ უნარებითა და ცოდნით განსაცვიფრებელი და საპასუხო ვებსაიტების შესაქმნელად.",
  },
  {
    id:'ent2',
    title: "მეწარმე 2",
    description:
      "კეთილი იყოს თქვენი მობრძანება ჩვენს HTML და CSS კურსში! ამ ყოვლის მომცველ პროგრამაში ჩვენ ჩავუღრმავდებით ვებ დეველოპმენტის სამყაროს და მოგიმზადებთ უნარებითა და ცოდნით განსაცვიფრებელი და საპასუხო ვებსაიტების შესაქმნელად. ჩვენ ჩავუღრმავდებით ვებ დეველოპმენტის სამყაროს და მოგიმზადებთ უნარებითა. კეთილი იყოს თქვენი მობრძანება ჩვენს HTML და CSS კურსში! ამ ყოვლის მომცველ პროგრამაში ჩვენ ჩავუღრმავდებით ვებ დეველოპმენტის სამყაროს და მოგიმზადებთ უნარებითა და ცოდნით განსაცვიფრებელი და საპასუხო ვებსაიტების შესაქმნელად.",
  },
  {
    id:'ent3',
    title: "მეწარმე 3",
    description:
      "კეთილი იყოს თქვენი მობრძანება ჩვენს HTML და CSS კურსში! ამ ყოვლის მომცველ პროგრამაში ჩვენ ჩავუღრმავდებით ვებ დეველოპმენტის სამყაროს და მოგიმზადებთ უნარებითა და ცოდნით განსაცვიფრებელი და საპასუხო ვებსაიტების შესაქმნელად. ჩვენ ჩავუღრმავდებით ვებ დეველოპმენტის სამყაროს და მოგიმზადებთ უნარებითა. კეთილი იყოს თქვენი მობრძანება ჩვენს HTML და CSS კურსში! ამ ყოვლის მომცველ პროგრამაში ჩვენ ჩავუღრმავდებით ვებ დეველოპმენტის სამყაროს და მოგიმზადებთ უნარებითა და ცოდნით განსაცვიფრებელი და საპასუხო ვებსაიტების შესაქმნელად.",
  },
];

const entrepreneurs = DUMMY_DATA.map(entrepreneur => (
    <Entrepreneur id={entrepreneur.id} key={entrepreneur.id}  title= {entrepreneur.title} description={entrepreneur.description}/>
))

const Entrepreneurship = () => {
  return (
    <>
      <MainBanner />
      {entrepreneurs}
      
    </>
  );
};

export default Entrepreneurship;
