import MainBanner from "../components/mainBanner/MainBanner";
import FacBackground from "../components/FAQ/FaqBackground";
import Faq from "../components/FAQ/Faq";

const DUMMY_DATA = [
  {
    id: "f1",
    title:
      "1 ჩვენი კურსები მიმართულია პროგრამირების შესწავლაზე, თქვენ შეგეძლებათ გაიაროთ თქვენთვის სასურველი კურსი",
      description:
      "კეთილი იყოს თქვენი მობრძანება ჩვენს HTML და CSS კურსში! ამ ყოვლისმომცველ პროგრამაში ჩვენ ჩავუღრმავდებით ვებ დეველოპმენტის სამყაროს და მოგიმზადებთ უნარებითა და ცოდნით განსაცვიფრებელი და საპასუხო ვებსაიტების შესაქმნელად. ხართ თუ არა დამწყები, წინასწარი გამოცდილების გარეშე, ან შუალედური დეველოპერი, რომელიც ცდილობს თქვენი უნარების გამკაცრებას, ეს კურსი განკუთვნილია ყველა დონის შემსწავლელთათვის.",
  },
  {
    id: "f2",
    title:
      "2 ჩვენი კურსები მიმართულია პროგრამირების შესწავლაზე, თქვენ შეგეძლებათ გაიაროთ თქვენთვის სასურველი კურსი",
      description:
      "კეთილი იყოს თქვენი მობრძანება ჩვენს HTML და CSS კურსში! ამ ყოვლისმომცველ პროგრამაში ჩვენ ჩავუღრმავდებით ვებ დეველოპმენტის სამყაროს და მოგიმზადებთ უნარებითა და ცოდნით განსაცვიფრებელი და საპასუხო ვებსაიტების შესაქმნელად. ხართ თუ არა დამწყები, წინასწარი გამოცდილების გარეშე, ან შუალედური დეველოპერი, რომელიც ცდილობს თქვენი უნარების გამკაცრებას, ეს კურსი განკუთვნილია ყველა დონის შემსწავლელთათვის.",
  },
  {
    id: "f3",
    title:
      "3 ჩვენი კურსები მიმართულია პროგრამირების შესწავლაზე, თქვენ შეგეძლებათ გაიაროთ თქვენთვის სასურველი კურსი",
      description:
      "კეთილი იყოს თქვენი მობრძანება ჩვენს HTML და CSS კურსში! ამ ყოვლისმომცველ პროგრამაში ჩვენ ჩავუღრმავდებით ვებ დეველოპმენტის სამყაროს და მოგიმზადებთ უნარებითა და ცოდნით განსაცვიფრებელი და საპასუხო ვებსაიტების შესაქმნელად. ხართ თუ არა დამწყები, წინასწარი გამოცდილების გარეშე, ან შუალედური დეველოპერი, რომელიც ცდილობს თქვენი უნარების გამკაცრებას, ეს კურსი განკუთვნილია ყველა დონის შემსწავლელთათვის.",
  },
];

const FAQS = DUMMY_DATA.map((faq) => (
  <Faq
      id={faq.id}
      key={faq.id}
      title={faq.title}
      description={faq.description}
    />
  ));

const FAQ = (props) => {
  return (
    <>
      <MainBanner />
      <FacBackground>
        {FAQS}
      </FacBackground>
    </>
  );
};

export default FAQ;
